# MoveNext Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSetIterator..::..MoveNext Method
AssetSetIterator Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Implements
IEnumerator..::..MoveNext()()()()
# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace